MainMenuTitle				= "Front Row";

/* Strings that need Apple TV replacements in Front Row */
NotConnectedToInternet							= "Tietokone ei ole yhteydessä internetiin.";
NotConnectedToNetwork							= "Tietokone ei ole yhteydessä verkkoon.";
FatalExceptionAlertDescription					= "Paina Toista/Tauko poistuaksesi Front Row'sta.";
